app/controllers/students_controller.rb

  def createStudent
    fn = params[:first_name]
    ln = params[:last_name]
    maj = params[:major]
    @student = Student.new(:first_name => fn,
      :last_name => ln, :major => maj)
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "major") VALUES ('chris', 'pacholczak', 'CENT') RETURNING "id"

  def selectStudent
    @students = Student.all
---
SELECT "students".* FROM "students"

  def deleteStudent
    id = params[:student_id]
    @student = Student.find_by_id(id)
    if @student.delete
---
SELECT "students".* FROM "students" WHERE "students"."id" = 14 LIMIT 1
DELETE FROM "students" WHERE "students"."id" = 14

  def editStudent
    id = params[:student_id]
    @student = Student.find_by_id(id)
---
SELECT "students".* FROM "students" WHERE "students"."id" = 5 LIMIT 1

  def updateStudent
    id = params[:student_id]
    fn = params[:first_name]
    ln = params[:last_name]
    maj = params[:major]
    Student.update(id,{:first_name => fn, :last_name => ln, :major => maj})
---
UPDATE "students" SET "first_name" = 'Roberts' WHERE "students"."id" = 6